Autodesk.Revit.DB.GeometryConversionTarget
Since:
2022
Specifies whether to import geometry as a Mesh or a Solid.
Since:
2022

Autodesk.Revit.DB.GeometryConversionTarget.None
Specifies not to convert the geometry.

Autodesk.Revit.DB.GeometryConversionTarget.Mesh
Specifies creation of a Mesh from the external geometry.

Autodesk.Revit.DB.GeometryConversionTarget.Solid
Specifies creation of a Solid from the external geometry.